; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   black_block_1 white_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (seen_psi_1))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (or (not (or (= ?obj white_block_1) (holding white_block_1))) (seen_psi_1)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (or (= ?obj white_block_1) (holding white_block_1)) (hold_0)) (when (and (clear black_block_1) (not (= ?obj black_block_1))) (seen_psi_1)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (or (not (and (holding white_block_1) (not (= ?obj white_block_1)))) (seen_psi_1)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (holding white_block_1) (not (= ?obj white_block_1))) (hold_0)) (when (or (= ?obj black_block_1) (clear black_block_1)) (seen_psi_1)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj) (or (not (and (holding white_block_1) (not (= ?obj white_block_1)))) (seen_psi_1)))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (and (holding white_block_1) (not (= ?obj white_block_1))) (hold_0)) (when (or (= ?obj black_block_1) (and (clear black_block_1) (not (= ?underobj black_block_1)))) (seen_psi_1)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty) (or (not (or (= ?obj white_block_1) (holding white_block_1))) (seen_psi_1)))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (or (= ?obj white_block_1) (holding white_block_1)) (hold_0)) (when (or (= ?underobj black_block_1) (and (clear black_block_1) (not (= ?obj black_block_1)))) (seen_psi_1)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   orange_block_1 yellow_block_1 black_block_2 - block
 )
 (:init (ontable orange_block_1) (ontable yellow_block_1) (ontable black_block_1) (on black_block_2 black_block_1) (on white_block_1 yellow_block_1) (clear orange_block_1) (clear black_block_2) (clear white_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on white_block_1 orange_block_1) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack black_block_2 black_block_1)
   deleted: (on black_block_2 black_block_1) (clear black_block_2) (handempty)
   added: (holding black_block_2) (clear black_block_1) (seen_psi_1)
   goals met: 0 of 2
2. (putdown black_block_2)
   deleted: (holding black_block_2)
   added: (clear black_block_2) (handempty) (ontable black_block_2)
   goals met: 0 of 2
3. (unstack white_block_1 yellow_block_1)
   deleted: (on white_block_1 yellow_block_1) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear yellow_block_1) (hold_0)
   goals met: 1 of 2
4. (stack white_block_1 orange_block_1)
   deleted: (clear orange_block_1) (holding white_block_1)
   added: (handempty) (clear white_block_1) (on white_block_1 orange_block_1)
   goals met: 2 of 2
